Certification/src/Documents/ОтсутствиеСотрудника/ОтсутствиеСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтсутствиеСотрудника</name>
  <registerRecords>AccumulationRegister.ОтсутствияСотрудников_Обороты</registerRecords>
  <registerRecords>InformationRegister.ОтсутствияСотрудников</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарий</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтсутствияСотрудника</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОтсутствия</name>
      <type>
        <types>CatalogRef.Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Certification/src/InformationRegisters/КадроваяИстория/КадроваяИстория.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КадроваяИстория</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСотрудника</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Certification/src/Documents/ОтсутствиеСотрудника/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КадроваяИсторияСрезПоследних.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(КадроваяИсторияСрезПоследних.Период) КАК Период
	|ПОМЕСТИТЬ вт_МаксПоКадровымДанным
	|ИЗ
	|	РегистрСведений.КадроваяИстория.СрезПоследних(&ДатаДок, Сотрудник = &Сотрудник) КАК КадроваяИсторияСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	КадроваяИсторияСрезПоследних.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_МаксПоКадровымДанным.Сотрудник КАК Сотрудник,
	|	КадроваяИстория.Подразделение КАК ПодразделениеСотрудника
	|ПОМЕСТИТЬ вт_КадровыеДанные
	|ИЗ
	|	вт_МаксПоКадровымДанным КАК вт_МаксПоКадровымДанным
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИстория КАК КадроваяИстория
	|		ПО вт_МаксПоКадровымДанным.Сотрудник = КадроваяИстория.Сотрудник
	|			И вт_МаксПоКадровымДанным.Период = КадроваяИстория.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтсутствиеСотрудникаОтсутствияСотрудника.Ссылка КАК Регистратор,
	|	""ОтсутствияСотрудников"" КАК ИмяРегистра_,
	|	ОтсутствиеСотрудникаОтсутствияСотрудника.ДатаНачала КАК Период,
	|	ОтсутствиеСотрудникаОтсутствияСотрудника.ВидОтсутствия КАК ВидОтсутствия,
	|	ОтсутствиеСотрудникаОтсутствияСотрудника.Часы КАК Часы,
	|	&Сотрудник КАК Сотрудник,
	|	вт_КадровыеДанные.ПодразделениеСотрудника КАК ПодразделениеСотрудника
	//Лобашова 05.06.2019 87154 +
	|	,
	|	ОтсутствиеСотрудникаОтсутствияСотрудника.Ссылка.Сценарий КАК Сценарий
	//Лобашова 05.06.2019 87154 -
	|ИЗ
	|	Документ.ОтсутствиеСотрудника.ОтсутствияСотрудника КАК ОтсутствиеСотрудникаОтсутствияСотрудника
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_КадровыеДанные КАК вт_КадровыеДанные
	|		ПО ОтсутствиеСотрудникаОтсутствияСотрудника.Ссылка.Сотрудник = вт_КадровыеДанные.Сотрудник
	|ГДЕ
	|	ОтсутствиеСотрудникаОтсутствияСотрудника.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("ссылка"    , ДокументСсылка);
	Запрос.УстановитьПараметр("Сотрудник" , ДокументСсылка.Сотрудник);
	Запрос.УстановитьПараметр("ДатаДок"   , ДокументСсылка.Дата);
	
    ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
    ТаблицыДляДвижений.Вставить("ТаблицаОтсутствияСотрудников"			, Запрос.Выполнить().Выгрузить());
	//Лобашова 05.06.2019 87154 +
    ТаблицыДляДвижений.Вставить("ТаблицаОтсутствияСотрудников_Обороты"	, Запрос.Выполнить().Выгрузить());	
	//Лобашова 05.06.2019 87154 -
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.Рецепт.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.Рецепт.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.Рецепт.СоздатьДокумент();
	КонецЕсли;
КонецПроцедуры
